<!doctype html>
<html lang="ru">
<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <title>BarBoss Catering - администрирование</title>
</head>
<body>
<h2>Работа с фотоотчётами</h2>
<p>В списке категорий выбрать <b>"фотоотчёты"</b>.</p>
<div><img src="/faq/FAQ-02.jpg" alt="Список категорий"/></div>
<p>Появится список фотоотчётов: название, дата, "в корзину".</p>
<div><img src="/faq/FAQ-03.jpg" alt="Список фотоотчётов"/></div>
<p><b>Название:</b> является ссылкой на редкатирование. Может быть двух цветов: <span style="color: #08C;">синий</span> и <span style="color: gray;">серый</span>. Это означает, что фотоотчёт опубликован или не опубликован соответственно.</p>
<p><b>Дата публикация.</b> Может быть двух цветов: черный и <span style="color: orange;">оранжевый</span>. Второй цвет означает, что дата публикации позже текущего дня и фотоотчёт не опубликован. Список фотоотчётов сортируется по дате по убыванию.</p>
<p><b>Иконка "в корзину":</b> фотоотчёт будет перемещён в корзину.</p>
<p><span style="color: #008000; text-decoration: underline;">Добавить</span>: соответственно добавление нового фотоотчёта.</p>
<p><i>Нажимаем на название одного из фотоотчётов и переходим в редактор фотоотчёта.</i></p>
<div><img src="/faq/FAQ-04.jpg" alt="Список фотоотчётов"/></div>
<p><b>Заголовок:</b> видим на сайте.</p>
<p><b>Опубликовано:</b> галочка есть - фотоотчёт отображается на сайте, галочки нет - фотоотчёт скрыт.</p>
<p><b>Дата:</b> тоже отображается на сайте.</p>
<p><span style="color: #08C;"><b>Галерея</b></span>: ссылка на список фотографий фотоотчёта.</p>
<p><b>Текст:</b> перед фотографиями на сайте можно написать что-нибудь.</p>
<p><b>Сохранить</b> и <b>Сохранить и закрыть</b>: сохранение всех изменений, после нажатия на первую кнопку остаёшься в редакторе, нажатие на вторую переносит в список фотоотчётов.</p>
<p><i>Нажимаем на "Галерея и переходим в список фотографий фотоотчёта.</i></p>
<div><img src="/faq/FAQ-05.jpg" alt="Пустая галерея"/></div>
<p><i>Пустая галерея</i></p>
<p>Для добавления фотографий нажать <b>"Обзор"</b>, выбрать фотографии и затем нажать <b>"Добавить"</b>.</p>
<p><i>После добавления фотографий</i></p>
<div><img src="/faq/FAQ-06.jpg" alt="Галерея"/></div>
<p><i>Все фотографии уменьшаются до 720 пикселей по высоте.</i></p>
<p><b>Alt:</b> параметр фотографий на любом сайте. Этот текст показывается, когда фотография подгружается или когда фотография не доступна по каким-то причинам.</p>
<p><b>Комментарий:</b> не используется на сайте. По умолчанию название фотографии.</p>
<p><b>Порядок вывода:</b> из названия понятно, зачем. Фотография с 1 - используется в списке фотоотчётов.</p>
<p>Для сохранения изменений под фотографией поставить галочку и нажать на кнопку <b>"Применить"</b>.</p>
<p>Если после редактирования в порядке фотографий будет бордак, можно нажать на кнопку "Пересчитать порядок" и всё пересчитается от 1 до максимума."</p>
<p>Для удаления фотографий: поставить под фото галочку с "На удаление", затем внизу поставить галочку рядом с "подтвердить удаление", отметить "удаление" и нажать на "Применить".</p>
</body>
</html>